app/Models/Model_Admin.php

SELECT *
FROM `t_penerbit`
ORDER BY `id_penerbit` ASC
---
    public function AllData()
    {
        return $this->orderBy('id_penerbit', "asc")->findAll();

INSERT INTO `t_penerbit` (`id_penerbit`, `nama_penerbit`, `alamat`, `kota`, `telepon`) VALUES ('SP03', 'Danendra', 'Jl. Moch. Toha 44', 'Bandung', '022-5201215')
---
    public function Tambahp($data)
    {
        $this->db->table('t_penerbit')->insert($data);

UPDATE `t_buku` SET `id_buku` = 'B1001', `kategori` = 'Bisnis', `nama_buku` = 'Bisnis Online', `harga` = '75000', `stok` = '9', `nama_penerbit` = 'Penerbit Informatika'
WHERE `id_buku` = 'B1001'
---
    public function ubahdata($data)
    {
        $this->db->table('t_buku')->where('id_buku', $data['id_buku'])->update($data);