app/Models/Model_Home.php

    public function AllData()
    {
        return $this->orderBy('id_buku', "asc")->findAll();
---
SELECT *
FROM `t_buku`
ORDER BY `id_buku` ASC

    public function cari($detail)
    {
        return $this->db->table('t_buku')->join(
            't_penerbit',
            't_penerbit.nama_penerbit=t_buku.nama_penerbit'
        )->where('nama_buku', $detail)->get()->getResultArray();
---
SELECT *
FROM `t_buku`
JOIN `t_penerbit` ON `t_penerbit`.`nama_penerbit`=`t_buku`.`nama_penerbit`
WHERE `nama_buku` = ('Autocad 3 Dimensi')